Учебная/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолМЖ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТрудоваяДеятельность</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Учебная/src/Enums/ПолМЖ/ПолМЖ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолМЖ</name>
  <enumValues>
    <name>М</name>
    <comment>Мужской</comment>
  </enumValues>
  <enumValues>
    <name>Ж</name>
    <comment>Женский</comment>
  </enumValues>
</mdclass:Enum>

Учебная/src/Catalogs/Сотрудники/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ОбновитьФИО();
	Если ПустаяСтрока(Объект.Отчество) Тогда
		Возврат;
	КонецЕсли;
	
	ОкончаниеОтчества = Нрег(Прав(Объект.Отчество,2));
	
	Если ОкончаниеОтчества = "на" Тогда
		Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолМЖ.Ж");
	ИначеЕсли ОкончаниеОтчества = "ич" Тогда
		Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолМЖ.М"); 	
	Иначе Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолМЖ.ПустаяСсылка"); 	 	
	КонецЕсли;	
КонецПроцедуры

Процедура   ОбновитьФИО ()
	Объект.Наименование = Объект.Фамилия + " " + Лев(Объект.Имя,1) + ". " + Лев(Объект.Отчество,1) + ".";
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ОбновитьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	ОбновитьФИО();
КонецПроцедуры
